# CoolingLoad Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..CoolingLoad Property
SpecTypeId Class See Also
---
Cooling Load, in discipline HVAC.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId CoolingLoad { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CoolingLoad As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CoolingLoad {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace